snlkuharlocal/src/Documents/ХранилищеКодовМаркировки/ХранилищеКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ХранилищеКодовМаркировки</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ОтчетКассовойСмены</basedOn>
  <basedOn>Document.СписаниеТМЦ</basedOn>
  <basedOn>Document.ЗаданиеНаМаркировку</basedOn>
  <basedOn>Document.ПередачаКодовМаркировкиМП</basedOn>
  <basedOn>Document.ЗаданиеНаСборкуКомплектовЧЗ</basedOn>
  <basedOn>Document.РекламационнаяНакладная</basedOn>
  <basedOn>Document.МаркировкаОстатковТЦ</basedOn>
  <basedOn>Document.Претензия</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратОтПокупателя</types>
      <types>DocumentRef.ОтчетКассовойСмены</types>
      <types>DocumentRef.ВыкупИМ</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.Возврат1ИМ</types>
      <types>DocumentRef.МаркировкаОстатковТЦ</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.ПередачаКодовМаркировкиМП</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Претензия</types>
      <types>DocumentRef.ЗаказИМ</types>
      <types>DocumentRef.ОприходованиеТМЦ</types>
      <types>DocumentRef.СписаниеТМЦ</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
      <types>DocumentRef.ВозвратИМ</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУзлаСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГрупповыхКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоШтучныхКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланФакт</name>
    <type>
      <types>EnumRef.ПланФакт</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель_Карантин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель_Карантин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.СкладскиеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоШтуквХКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>EnumRef.СкладскиеОперации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодНабора</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>EnumRef.СкладскиеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>КодКомплектующегоНеНанесен</name>
      <comment>Не нанесен</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/СкладскиеОперации/СкладскиеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СкладскиеОперации</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПриемка</name>
    <comment>Для шапок ОКС с возвратами</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыШтрихКодов/ТипыШтрихКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШтрихКодов</name>
  <enumValues>
    <name>Штука</name>
    <comment>Штрих код штуки</comment>
  </enumValues>
  <enumValues>
    <name>Блочок</name>
    <comment>Штрих код блочка</comment>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
    <comment>Штрих код коробки</comment>
  </enumValues>
  <enumValues>
    <name>Палета</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыУпаковок/ТипыУпаковок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУпаковок</name>
  <enumValues>
    <name>МаркированныйТовар</name>
  </enumValues>
  <enumValues>
    <name>МонотоварнаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>МультитоварнаяУпаковка</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыКодовМаркировки/ТипыКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКодовМаркировки</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
  <enumValues>
    <name>ЛогистическаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Documents/ХранилищеКодовМаркировки/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МаркировкаК.ПроверкаРазрешенияРедактированияУФ(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Если ПолучитьРеквизитШапки(Объект.Ссылка, "КодУзлаСоздания")<>Маркировка_ПИ.ЭтотУзел_Код() Тогда
			//ТолькоПросмотр = Истина;		
		КонецЕсли; 
	КонецЕсли; 
	
	Элементы.гШтрихкодыУпаковок.Заголовок 	= СтрШаблон("КМ (%1)", 		Формат(Объект.ШтрихкодыУпаковок.Количество(), "ЧРГ=' '; ЧГ=3,0"));
	Элементы.гТовары.Заголовок 				= СтрШаблон("Товары (%1)",	Формат(Объект.Товары.Количество(), "ЧРГ=' '; ЧГ=3,0"));
КонецПроцедуры

&НаКлиенте
Процедура Перезаполнить(Команда)
	Перезаполнить_НаСервере();
КонецПроцедуры

&НаСервере
Процедура Перезаполнить_НаСервере()
	// Кухарь А.Ю.  21.03.2025 начало
	// Пустая задача
	если ТипЗнч(объект.ДокОснование) = Тип("ДокументСсылка.РасходнаяНакладная") тогда
		Документы.ХранилищеКодовМаркировки.Создать_ХКМ_к_РНК(объект.ДокОснование);
		Возврат;
	КонецЕсли;
	// Кухарь А.Ю.  21.03.2025 конец
	
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.Заполнить(ДокОбъект.ДокОснование);	
	
	ЗначениеВДанныеФормы(ДокОбъект, Объект);
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьКоды(Команда)
	Для Каждого ШтрихкодУпаковки Из ВвестиКоды() Цикл
		СтрокаТЧ = Объект.ШтрихкодыУпаковок.Добавить();							
		СтрокаТЧ.ШтрихкодУпаковки = ШтрихкодУпаковки;			
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКодыКоробок(Команда)
	ДобавитьКодыКоробок_НаСервере(ВвестиКоды());	
КонецПроцедуры                        

&НаСервере
Процедура ДобавитьКодыКоробок_НаСервере(ШтрихКодыКоробок)
	Сч = 0;
	Для Каждого ШтрихкодКоробки Из ШтрихКодыКоробок Цикл
		Объект.ШтрихкодыУпаковок[Сч].ШтрихКодКоробки = ШтрихкодКоробки;		
		Сч = Сч + 1;
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура УдалитьКоды(Команда)
	Коды = ВвестиКоды();
	УдалитьКоды_НаСервере(Коды);	
КонецПроцедуры

&НаСервере
Процедура УдалитьКоды_НаСервере(Коды)
	УдаляемыеКоды 	= Новый Соответствие;
	УдаляемыеСтроки = Новый Массив;
	
	Для Каждого Код Из Коды Цикл
		УдаляемыеКоды[Код] = Истина;	
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из Объект.ШтрихкодыУпаковок Цикл
		Если УдаляемыеКоды[СтрокаТЧ.ШтрихкодУпаковки] <> Неопределено Тогда
			УдаляемыеСтроки.Добавить(СтрокаТЧ);
		КонецЕсли; 					
	КонецЦикла; 		
	
	Для Каждого СтрокаТЧ Из УдаляемыеСтроки Цикл
		Объект.ШтрихкодыУпаковок.Удалить(СтрокаТЧ);	
		Модифицированность = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ВвестиКоды()
	мКоды = Новый Массив;
	СтрокаКодов = "";
	Если ВвестиСтроку(СтрокаКодов, "Введите коды маркировки", , Истина) Тогда
		Для Каждого Строка Из СтрРазделить(СтрокаКодов, Символы.ПС) Цикл
			Строка = СтрЗаменить(Строка,"(01)","");		
			Строка = СтрЗаменить(Строка,"(21)","");		
			Строка = СтрЗаменить(Строка," ","");		
			
			ШтрихкодУпаковки = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоНаименованию(Строка, Истина);
			Если НЕ ШтрихкодУпаковки.Пустая() Тогда
				мКоды.Добавить(ШтрихкодУпаковки.Ссылка);				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
	Возврат мКоды;
КонецФункции // ()

&НаКлиенте
Процедура ПерезаполнитьОтправителяПолучателя(Команда)
	ПерезаполнитьОтправителяПолучателя_НаСервере();
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьОтправителяПолучателя_НаСервере()
	рПолучения = Документы.ХранилищеКодовМаркировки.ОпределитьОтправителяПолучателя(Объект.ДокОснование);
	
	Объект.Отправитель 	= рПолучения.Отправитель;
	Объект.Получатель	= рПолучения.Получатель;
КонецПроцедуры

&НаКлиенте
Процедура ЗабронироватьКодыПодПРМ(Команда)
	Ошибки = Новый Массив;
	Если ТипЗнч(Объект.ДокОснование) <> Тип("ДокументСсылка.Перемещение") Тогда
		Ошибки.Добавить("Док. основание не является перемещением !");
	КонецЕсли;
	Если Маркировка_ПИ.ТипТекущегоУзла() <> Перечисления.ТипУзлаИБ.Склад Тогда
		Ошибки.Добавить("Заполнять документ можно только на складе !");
	КонецЕсли;
	Если Объект.Операция <> Перечисления.СкладскиеОперации.Отгрузка Тогда
		Ошибки.Добавить("Заполнять документ можно только при отгрузке !");
	КонецЕсли;
	
	Если Ошибки.Количество() <> 0 Тогда
		ПоказатьПредупреждение(, СтрСоединить(Ошибки, Символы.ПС));
		Возврат;	
	КонецЕсли; 	
	
	Если МаркировкаК.ЗаписатьИзмененныйОбъектВУпрФорме(ЭтаФорма) Тогда	
		рБронирования = ЗабронироватьКодыПодПРМ_НаСервере();
		Если рБронирования.Успешно Тогда
			Сообщить("Забронированы коды под " + Объект.ДокОснование, СтатусСообщения.Важное);
		Иначе
			МаркировкаКС.ВывестиОшибки(рБронирования);		
		КонецЕсли; 
		МаркировкаКС.ВывестиСообщения(рБронирования);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ЗабронироватьКодыПодПРМ_НаСервере()
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Если Объект.Ссылка.Пустая() ИЛИ НЕ Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ	
	|	Номенклатура									КАК Номенклатура,
	|	Номенклатура.Код								КАК Номенклатура_Код,
	|	IsNULL(Номенклатура.Родитель.ШтукВКоробке,	0) 	КАК ШтукВКоробке,
	|	СУММА(Количество) 								КАК Количество
	|ИЗ
	|	Документ.Перемещение.Товары
	|ГДЕ
	|	Ссылка = &ДокОснование	
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура,
	|	Номенклатура.Родитель.ШтукВКоробке	
	|ИМЕЮЩИЕ
	|	СУММА(Количество)>0	
	|";
	
	Запрос.УстановитьПараметр("ДокОснование", Объект.ДокОснование);
	
	Объект.ШтрихкодыУпаковок.Очистить();
	
	ВсегоКоробок = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ШтукВКоробке > 0 Тогда
			ВсегоКоробок = ВсегоКоробок + Цел(Выборка.Количество/Выборка.ШтукВКоробке);					
			Если Выборка.Количество % Выборка.ШтукВКоробке > 0 Тогда
				Сообщить("Дробное количество коробок: " + Выборка.Номенклатура, СтатусСообщения.Важное);
			КонецЕсли; 
		КонецЕсли;
		
		пБронирования	= Новый Структура("Местонахождение,Количество", Объект.Получатель, Выборка.Количество);
		рШтуки			= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(Выборка.Номенклатура, Объект.Ссылка, пБронирования);
		Если рШтуки.Успешно Тогда
			Для каждого ШтрихКодУпаковки Из рШтуки.Данные Цикл
				СтрокаТЧ = Объект.ШтрихкодыУпаковок.Добавить();			
				СтрокаТЧ.ШтрихкодУпаковки = ШтрихКодУпаковки;
			КонецЦикла; 
			
			ТекстСообщения = СтрШаблон("Забронировано %1 кодов штук, по номенклатуре: %2 (%3).", Выборка.Количество, Выборка.Номенклатура, Выборка.Номенклатура_Код);
			Результат.Сообщения.Добавить(ТекстСообщения);
		Иначе			
			МаркировкаКС.ДобавитьОшибки(Результат, рШтуки);
			Прервать;
		КонецЕсли; 		
	КонецЦикла; 
	
	Если Результат.Ошибки.Количество() = 0 Тогда
		Если ВсегоКоробок > 0 Тогда
			рКоробки = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьСвободныеКодыАгрегации(Перечисления.ТипыШтрихКодов.Коробка, Перечисления.ТипыУпаковок.МонотоварнаяУпаковка, ВсегоКоробок);
			Если рКоробки.Успешно Тогда
				Сч = 0;
				Для каждого ШтрихкодКоробки Из рКоробки.Данные Цикл
					СтрокаТЧ = Объект.ШтрихкодыУпаковок[Сч];			
					СтрокаТЧ.ШтрихкодКоробки = ШтрихкодКоробки;
					
					Сч = Сч+1;
				КонецЦикла;
				
				Результат.Сообщения.Добавить("Забронировано "+ВсегоКоробок+" кодов коробок.");
			Иначе				
				МаркировкаКС.ДобавитьОшибки(Результат, рКоробки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
	    Записать();		
	Исключение
		Объект.ШтрихкодыУпаковок.Очистить();
		
		Сообщить("Не удалось провести документ ! " + ОписаниеОшибки(), СтатусСообщения.Важное);		
	КонецПопытки;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);	
	Возврат Результат;	
КонецФункции

&НаКлиенте
Процедура ДобавитьКодыАгрегаций(Команда)    
	СтрокаКодов = "";
	Если ВвестиСтроку(СтрокаКодов, "Введите коды коробок", , Истина) Тогда
		ДобавитьКодыАгрегаций_НаСервере(СтрокаКодов);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьКодыАгрегаций_НаСервере(СтрокаКодов)
	тКодов = Новый ТаблицаЗначений;
	тКодов.Колонки.Добавить("СтрокаКМ", ПолучитьОписаниеТиповСтроки(150));
	Для Каждого СтрокаКМ Из СтрРазделить(СтрокаКодов, Символы.ПС) Цикл
		СтрокаКМ = СтрЗаменить(СтрокаКМ,"(01)","");		
		СтрокаКМ = СтрЗаменить(СтрокаКМ,"(21)","");		
		СтрокаКМ = СтрЗаменить(СтрокаКМ," ","");		
		
		Если НЕ ПустаяСтрока(СтрокаКМ) Тогда
			СтрокаТ = тКодов.Добавить();
			СтрокаТ.СтрокаКМ = СтрокаКМ;		
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_КодыАгрегаций ИЗ &тКодов КАК тКодов
	|;
	|ВЫБРАТЬ		
	|	Спр.Ссылка 		КАК ШтрихкодКоробки,
	|	Спр.Штрихкод	КАК ШтрихкодУпаковки
	|ИЗ
	|	ВТ_КодыАгрегаций
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК Спр
	|ПО		
	|	Спр.Ссылка.Наименование = ВТ_КодыАгрегаций.СтрокаКМ
	|	И Спр.Ссылка.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)
	|";
	
	Запрос.УстановитьПараметр("тКодов", тКодов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = Объект.ШтрихкодыУпаковок.Добавить();		
		СтрокаТЧ.ШтрихкодУпаковки	= Выборка.ШтрихкодУпаковки;
		СтрокаТЧ.ШтрихкодКоробки  	= Выборка.ШтрихкодКоробки;
	КонецЦикла;
	
КонецПроцедуры
